notes/oct23/oct23.org
#+html_head: <link rel="stylesheet" type="text/css" href="../../htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../readtheorg.css"/>
#+html_head: <script src="../../jquery.min.js"></script>
#+html_head: <script src="../../bootstrap.min.js"></script>
#+html_head: <script type="text/javascript" src="../../readtheorg.js"></script>

#+Author: Julian Grove
#+Title: Applicative categorial grammar

* Review
  We recently introduced applicative categorial grammar, which we are using to
  (a) give syntactic analyses of a fragment of English, and (b) map the
  syntactic derivations (or structures) assigned to expressions via such
  analyses onto semantic representations of some kind. Such representations
  include, e.g., simply typed λ-terms and/or model-theoretic constructions (like
  entities and functions, etc.), as we've seen. We will explore more options
  going forward!

