notes/oct23/oct23.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-28 Sat 15:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Applicative categorial grammar</title>
<meta name="author" content="Julian Grove" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Applicative categorial grammar</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org08a9785">1. Review</a>
<ul>
<li><a href="#org7dcea2b">1.1. Encoding applicative categorial grammar</a></li>
<li><a href="#org4116082">1.2. Interpreting English into the simply typed λ-calculus</a></li>
<li><a href="#org669fd3e">1.3. Exercise</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org08a9785" class="outline-2">
<h2 id="org08a9785"><span class="section-number-2">1.</span> Review</h2>
<div class="outline-text-2" id="text-1">
<p>
We recently introduced applicative categorial grammar, which we are using to
(a) give syntactic analyses of a fragment of English, and (b) map the
syntactic derivations (or structures) assigned to expressions via such
analyses onto semantic representations of some kind. Such representations
include, e.g., simply typed λ-terms and/or model-theoretic constructions (like
entities and functions, etc.), as we've seen. We will explore more options
going forward!
</p>
</div>
