notes/oct23/oct23.org
** Encoding applicative categorial grammar
   To start out, we introduce a set of categories. This set is defined to
   comprise /base/ categories, like ~NP~, ~N~, and ~S~, as well as complex categories,
   like ~c1 :\: c2~ and ~c1 :/∶ c2~ (given categories ~c1~ and ~c2~).
   #+begin_src haskell
     data Cat = NP | N | S
 	      | Cat :\: Cat
	      | Cat :/: Cat
   #+end_src
   Here, ~NP~ is meant to encode the category of noun phrases (e.g., /julian/, /the
   dog/), ~N~, the category of nouns (e.g., /dog/), and ~S~, the category of full
   sentences (e.g., /julian saw the dog/). In terms of these categories, we can
   encode the notion a /word/---that is, an atomic expression---as a constructor
   that associates a ~String~ with a ~Cat~. (Note that I've renamed the data type
   encoding categories at the term level from ~Lol c~ to ~IsA c~, in light of
   Aaron's comment.)
   #+begin_src haskell
     data Word (c :: Cat) = Word String (IsA c)

     data IsA (c :: Cat) where
       IsAnNP :: IsA NP
       IsAnN :: IsA N
       IsAnS :: IsA S
       (::\::) :: IsA c1 -> IsA c2 -> IsA (c1 :\: c2)
       (::/::) :: IsA c1 -> IsA c2 -> IsA (c1 :/: c2)
   #+end_src
   For example, the word /slept/, we can encode as ~Word "slept" (IsAnNP ::\::
   IsAnS)~, taking into account that /slept/ is a verb phrase. Meanwhile, /julian/,
   we can encode as ~Word "julian" IsAnNP~, taking into account that /julian/ is a
   noun phrase. By the way, let's also include ~Show~ instances.
   #+begin_src haskell
     instance Show (IsA c) where
       show IsAnNP = "np"
       show IsAnN = "n"
       show IsAnS = "s"
       show (c1 ::\:: c2) = "(" ++ show c1 ++ "\\" ++ show c2 ++ ")"
       show (c1 ::/:: c2) = "(" ++ show c1 ++ "/" ++ show c2 ++ ")"

     instance Show (Word c) where
       show (Word s c) = "(" ++ s ++ " ⊢ " ++ show c ++ ")"
   #+end_src
   
   To put words together, we need a grammar of expressions. Thus we also provide
   the data type ~Expr c~ (with its associated ~Show~ instance).
   #+begin_src haskell
     data Expr (c :: Cat) where
       Lex :: Word c -> Expr c
       AppL :: Expr c1 -> Expr (c1 :\: c2) -> Expr c2
       AppR :: Expr (c2 :/: c1) -> Expr c1 -> Expr c2

     instance Show (Expr c) where
       show (Lex w) = show w
       show (AppL e1 e2) = "(" ++ show e1 ++ " ◃ " ++ show e2 ++ ")"
       show (AppR e1 e2) = "(" ++ show e1 ++ " ▹ " ++ show e2 ++ ")"
   #+end_src
   Now we can analyze such sentences as, e.g., /julian slept/ and /julian taught
   carina/:
   #+begin_src haskell
     >>> (AppL (Lex (Word "julian" IsAnNP)) (Lex (Word "slept" (IsAnNP ::\:: IsAnS))))
     ((julian ⊢ np) ◃ (slept ⊢ (np\s)))
     >>> (AppL (Lex (Word "julian" IsAnNP)) (AppR (Lex (Word "taught" ((IsAnNP ::\:: IsAnS) ::/:: IsAnNP))) (Lex (Word "carina" IsAnNP))))
     ((julian ⊢ np) ◃ ((taught ⊢ ((np\s)/np)) ▹ (carina ⊢ np)))
   #+end_src
   Absolutely amazing.

