notes/oct23/oct23.html

<div id="outline-container-org7dcea2b" class="outline-3">
<h3 id="org7dcea2b"><span class="section-number-3">1.1.</span> Encoding applicative categorial grammar</h3>
<div class="outline-text-3" id="text-1-1">
<p>
To start out, we introduce a set of categories. This set is defined to
comprise <i>base</i> categories, like <code>NP</code>, <code>N</code>, and <code>S</code>, as well as complex categories,
like <code>c1 :\: c2</code> and <code>c1 :/∶ c2</code> (given categories <code>c1</code> and <code>c2</code>).
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">data</span> <span style="color: #d3869b;">Cat</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">NP</span> <span style="color: #83a598;">|</span> <span style="color: #d3869b;">N</span> <span style="color: #83a598;">|</span> <span style="color: #d3869b;">S</span>
         <span style="color: #83a598;">|</span> <span style="color: #d3869b;">Cat</span> <span style="color: #d3869b;">:\:</span> <span style="color: #d3869b;">Cat</span>
         <span style="color: #83a598;">|</span> <span style="color: #d3869b;">Cat</span> <span style="color: #d3869b;">:/:</span> <span style="color: #d3869b;">Cat</span>
</pre>
</div>
<p>
Here, <code>NP</code> is meant to encode the category of noun phrases (e.g., <i>julian</i>, <i>the
dog</i>), <code>N</code>, the category of nouns (e.g., <i>dog</i>), and <code>S</code>, the category of full
sentences (e.g., <i>julian saw the dog</i>). In terms of these categories, we can
encode the notion a <i>word</i>&#x2014;that is, an atomic expression&#x2014;as a constructor
that associates a <code>String</code> with a <code>Cat</code>. (Note that I've renamed the data type
encoding categories at the term level from <code>Lol c</code> to <code>IsA c</code>, in light of
Aaron's comment.)
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">data</span> <span style="color: #d3869b;">Word</span> (c <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Cat</span>) <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Word</span> <span style="color: #d3869b;">String</span> (<span style="color: #d3869b;">IsA</span> c)

<span style="color: #fb4933;">data</span> <span style="color: #d3869b;">IsA</span> (c <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Cat</span>) <span style="color: #fb4933;">where</span>
  <span style="color: #d3869b;">IsAnNP</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">IsA</span> <span style="color: #d3869b;">NP</span>
  <span style="color: #d3869b;">IsAnN</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">IsA</span> <span style="color: #d3869b;">N</span>
  <span style="color: #d3869b;">IsAnS</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">IsA</span> <span style="color: #d3869b;">S</span>
  (<span style="color: #d3869b;">::\::</span>) <span style="color: #83a598;">::</span> <span style="color: #d3869b;">IsA</span> c1 <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">IsA</span> c2 <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">IsA</span> (c1 <span style="color: #d3869b;">:\:</span> c2)
  (<span style="color: #d3869b;">::/::</span>) <span style="color: #83a598;">::</span> <span style="color: #d3869b;">IsA</span> c1 <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">IsA</span> c2 <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">IsA</span> (c1 <span style="color: #d3869b;">:/:</span> c2)
</pre>
</div>
<p>
For example, the word <i>slept</i>, we can encode as <code>Word "slept" (IsAnNP ::\::
   IsAnS)</code>, taking into account that <i>slept</i> is a verb phrase. Meanwhile, <i>julian</i>,
we can encode as <code>Word "julian" IsAnNP</code>, taking into account that <i>julian</i> is a
noun phrase. By the way, let's also include <code>Show</code> instances.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">instance</span> <span style="color: #d3869b;">Show</span> (<span style="color: #d3869b;">IsA</span> c) <span style="color: #fb4933;">where</span>
  show <span style="color: #d3869b;">IsAnNP</span> <span style="color: #83a598;">=</span> <span style="color: #b8bb26;">"np"</span>
  show <span style="color: #d3869b;">IsAnN</span> <span style="color: #83a598;">=</span> <span style="color: #b8bb26;">"n"</span>
  show <span style="color: #d3869b;">IsAnS</span> <span style="color: #83a598;">=</span> <span style="color: #b8bb26;">"s"</span>
  show (c1 <span style="color: #d3869b;">::\::</span> c2) <span style="color: #83a598;">=</span> <span style="color: #b8bb26;">"("</span> <span style="color: #83a598;">++</span> show c1 <span style="color: #83a598;">++</span> <span style="color: #b8bb26;">"\\"</span> <span style="color: #83a598;">++</span> show c2 <span style="color: #83a598;">++</span> <span style="color: #b8bb26;">")"</span>
  show (c1 <span style="color: #d3869b;">::/::</span> c2) <span style="color: #83a598;">=</span> <span style="color: #b8bb26;">"("</span> <span style="color: #83a598;">++</span> show c1 <span style="color: #83a598;">++</span> <span style="color: #b8bb26;">"/"</span> <span style="color: #83a598;">++</span> show c2 <span style="color: #83a598;">++</span> <span style="color: #b8bb26;">")"</span>

<span style="color: #fb4933;">instance</span> <span style="color: #d3869b;">Show</span> (<span style="color: #d3869b;">Word</span> c) <span style="color: #fb4933;">where</span>
  show (<span style="color: #d3869b;">Word</span> s c) <span style="color: #83a598;">=</span> <span style="color: #b8bb26;">"("</span> <span style="color: #83a598;">++</span> s <span style="color: #83a598;">++</span> <span style="color: #b8bb26;">" &#8866; "</span> <span style="color: #83a598;">++</span> show c <span style="color: #83a598;">++</span> <span style="color: #b8bb26;">")"</span>
</pre>
</div>

<p>
To put words together, we need a grammar of expressions. Thus we also provide
the data type <code>Expr c</code> (with its associated <code>Show</code> instance).
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">data</span> <span style="color: #d3869b;">Expr</span> (c <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Cat</span>) <span style="color: #fb4933;">where</span>
  <span style="color: #d3869b;">Lex</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Word</span> c <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Expr</span> c
  <span style="color: #d3869b;">AppL</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Expr</span> c1 <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Expr</span> (c1 <span style="color: #d3869b;">:\:</span> c2) <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Expr</span> c2
  <span style="color: #d3869b;">AppR</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Expr</span> (c2 <span style="color: #d3869b;">:/:</span> c1) <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Expr</span> c1 <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Expr</span> c2

<span style="color: #fb4933;">instance</span> <span style="color: #d3869b;">Show</span> (<span style="color: #d3869b;">Expr</span> c) <span style="color: #fb4933;">where</span>
  show (<span style="color: #d3869b;">Lex</span> w) <span style="color: #83a598;">=</span> show w
  show (<span style="color: #d3869b;">AppL</span> e1 e2) <span style="color: #83a598;">=</span> <span style="color: #b8bb26;">"("</span> <span style="color: #83a598;">++</span> show e1 <span style="color: #83a598;">++</span> <span style="color: #b8bb26;">" &#9667; "</span> <span style="color: #83a598;">++</span> show e2 <span style="color: #83a598;">++</span> <span style="color: #b8bb26;">")"</span>
  show (<span style="color: #d3869b;">AppR</span> e1 e2) <span style="color: #83a598;">=</span> <span style="color: #b8bb26;">"("</span> <span style="color: #83a598;">++</span> show e1 <span style="color: #83a598;">++</span> <span style="color: #b8bb26;">" &#9657; "</span> <span style="color: #83a598;">++</span> show e2 <span style="color: #83a598;">++</span> <span style="color: #b8bb26;">")"</span>
</pre>
</div>
<p>
Now we can analyze such sentences as, e.g., <i>julian slept</i> and <i>julian taught
carina</i>:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #83a598;">&gt;&gt;&gt;</span> (<span style="color: #d3869b;">AppL</span> (<span style="color: #d3869b;">Lex</span> (<span style="color: #d3869b;">Word</span> <span style="color: #b8bb26;">"julian"</span> <span style="color: #d3869b;">IsAnNP</span>)) (<span style="color: #d3869b;">Lex</span> (<span style="color: #d3869b;">Word</span> <span style="color: #b8bb26;">"slept"</span> (<span style="color: #d3869b;">IsAnNP</span> <span style="color: #d3869b;">::\::</span> <span style="color: #d3869b;">IsAnS</span>))))
((julian <span style="color: #83a598;">&#8866;</span> np) <span style="color: #83a598;">&#9667;</span> (slept <span style="color: #83a598;">&#8866;</span> (np<span style="color: #83a598;">\</span>s)))
<span style="color: #83a598;">&gt;&gt;&gt;</span> (<span style="color: #d3869b;">AppL</span> (<span style="color: #d3869b;">Lex</span> (<span style="color: #d3869b;">Word</span> <span style="color: #b8bb26;">"julian"</span> <span style="color: #d3869b;">IsAnNP</span>)) (<span style="color: #d3869b;">AppR</span> (<span style="color: #d3869b;">Lex</span> (<span style="color: #d3869b;">Word</span> <span style="color: #b8bb26;">"taught"</span> ((<span style="color: #d3869b;">IsAnNP</span> <span style="color: #d3869b;">::\::</span> <span style="color: #d3869b;">IsAnS</span>) <span style="color: #d3869b;">::/::</span> <span style="color: #d3869b;">IsAnNP</span>))) (<span style="color: #d3869b;">Lex</span> (<span style="color: #d3869b;">Word</span> <span style="color: #b8bb26;">"carina"</span> <span style="color: #d3869b;">IsAnNP</span>))))
((julian <span style="color: #83a598;">&#8866;</span> np) <span style="color: #83a598;">&#9667;</span> ((taught <span style="color: #83a598;">&#8866;</span> ((np<span style="color: #83a598;">\</span>s)<span style="color: #83a598;">/</span>np)) <span style="color: #83a598;">&#9657;</span> (carina <span style="color: #83a598;">&#8866;</span> np)))
</pre>
</div>
<p>
Absolutely amazing.
</p>
</div>
</div>
