notes/oct23/oct23.org
** Interpreting English into the simply typed λ-calculus
   We can interpret such expressions into λ-calculus in terms of a /type
   homomorphism/ ~SemType~, given atomic types ~E~ and ~T~.
   #+begin_src haskell
     type family SemType (c :: Cat) where
       SemType NP = E
       SemType S = T
       SemType N = E :-> T
       SemType (c1 :\: c2) = SemType c1 :-> SemType c2
       SemType (c2 :/: c1) = SemType c1 :-> SemType c2
   #+end_src
   Thus for example, verb phrases---that is, expressions of category ~NP :\:
   S~---are given the semantic type ~SemType (NP :\: S)~ = ~SemType NP :-> SemType S~
   = ~E :-> T~, putting them on a par with nouns, semantically.

   We should additionally begin adding /constants/ to our λ-calculus to encode the
   meanings of basic English expressions. Thus we define a data type ~Constant~.
   #+begin_src haskell
     data Constant (φ :: Type) where
       Dog :: Constant (E :-> T)
       Sleep :: Constant (E :-> T)
       Teach :: Constant (E :-> (E :-> T))
       C :: Constant E
       J :: Constant E
   #+end_src
   We now also need an additional constructor in our encoding of the λ-calculus,
   in order to inject constants into the data type.
   #+begin_src haskell
     data Term (γ :: Context) (φ :: Type) where
       Var :: In φ γ -> Term γ φ
       Lam :: Term (Con φ γ) ψ -> Term γ (φ :-> ψ)
       App :: Term γ (φ :-> ψ) -> Term γ φ -> Term γ ψ
       Con :: Constant φ -> Term γ φ
   #+end_src
   Note that the contexts in which constants are well typed are arbitrary by
   design. This property allows us to use them anywhere inside a λ-term.

   We may now write a function ~interpWord~ to interpret words of English into the
   λ-calculus, along with an associated function ~interpExpr~, which extends the
   interpretation of words to an interpretation of entire complex expressions.
   #+begin_src haskell
     interpWord :: Word c -> Term Empty (SemType c)
     interpWord (Word "carina" IsAnNP) = Con C                       -- ⟦'carina'⟧ = c
     interpWord (Word "julian" IsAnNP) = Con J                       -- ⟦'julian'⟧ = j
     interpWord (Word "dog" IsAnN) = Lam (App (Con Dog) (Var First)) -- ⟦'dog'⟧ = λx.dog(x)
     interpWord (Word "slept" (IsAnNP ::\:: IsAnS)) =                -- ⟦'slept'⟧ = λx.sleep(x)
       Lam (App (Con Sleep) (Var First))
     interpWord (Word "taught" ((IsAnNP ::\:: IsAnS) ::/:: IsAnNP)) = -- ⟦'taught'⟧ = λx, y.teach(x)(y)
       Lam (Lam (App (App (Con Teach) (Var (Next First))) (Var First)))


     interpExpr :: Expr c -> Term Empty (SemType c)
     interpExpr (Lex w) = interpWord w
     interpExpr (AppL e1 e2) = App (interpExpr e2) (interpExpr e1)
     interpExpr (AppR e1 e2) = App (interpExpr e1) (interpExpr e2)
   #+end_src
   For example, you can interpret /julian taught carina/ by doing
   #+begin_src haskell
     >>> interpExpr (AppL (Lex (Word "julian" IsAnNP)) (AppR (Lex (Word "taught" ((IsAnNP ::\:: IsAnS) ::/:: IsAnNP))) (Lex (Word "carina" IsAnNP))))
     App (App (Lam (Lam (App (App (Con Teach) (Var (Next First))) (Var First)))) (Con C)) (Con J) -- (λx, y.teach(x)(y)) c j
   #+end_src
  Compare to what you get if you also apply ~normalForm~ at the top:
  #+begin_src haskell
    >>> normalForm (interpExpr (AppL (Lex (Word "julian" IsAnNP)) (AppR (Lex (Word "taught" ((IsAnNP ::\:: IsAnS) ::/:: IsAnNP))) (Lex (Word "carina" IsAnNP)))))
    App (App (Con Teach) (Con C)) (Con J) -- teach(c)(j)
   #+end_src
  Neat.

