notes/oct23/oct23.html

<div id="outline-container-org4116082" class="outline-3">
<h3 id="org4116082"><span class="section-number-3">1.2.</span> Interpreting English into the simply typed λ-calculus</h3>
<div class="outline-text-3" id="text-1-2">
<p>
We can interpret such expressions into λ-calculus in terms of a <i>type
homomorphism</i> <code>SemType</code>, given atomic types <code>E</code> and <code>T</code>.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">type</span> <span style="color: #fb4933;">family</span> <span style="color: #d3869b;">SemType</span> (c <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Cat</span>) <span style="color: #fb4933;">where</span>
  <span style="color: #d3869b;">SemType</span> <span style="color: #d3869b;">NP</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">E</span>
  <span style="color: #d3869b;">SemType</span> <span style="color: #d3869b;">S</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">T</span>
  <span style="color: #d3869b;">SemType</span> <span style="color: #d3869b;">N</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">E</span> <span style="color: #d3869b;">:-&gt;</span> <span style="color: #d3869b;">T</span>
  <span style="color: #d3869b;">SemType</span> (c1 <span style="color: #d3869b;">:\:</span> c2) <span style="color: #83a598;">=</span> <span style="color: #d3869b;">SemType</span> c1 <span style="color: #d3869b;">:-&gt;</span> <span style="color: #d3869b;">SemType</span> c2
  <span style="color: #d3869b;">SemType</span> (c2 <span style="color: #d3869b;">:/:</span> c1) <span style="color: #83a598;">=</span> <span style="color: #d3869b;">SemType</span> c1 <span style="color: #d3869b;">:-&gt;</span> <span style="color: #d3869b;">SemType</span> c2
</pre>
</div>
<p>
Thus for example, verb phrases&#x2014;that is, expressions of category <code>NP :\:
   S</code>&#x2014;are given the semantic type <code>SemType (NP :\: S)</code> = <code>SemType NP :-&gt; SemType S</code>
= <code>E :-&gt; T</code>, putting them on a par with nouns, semantically.
</p>

<p>
We should additionally begin adding <i>constants</i> to our λ-calculus to encode the
meanings of basic English expressions. Thus we define a data type <code>Constant</code>.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">data</span> <span style="color: #d3869b;">Constant</span> (&#966; <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Type</span>) <span style="color: #fb4933;">where</span>
  <span style="color: #d3869b;">Dog</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Constant</span> (<span style="color: #d3869b;">E</span> <span style="color: #d3869b;">:-&gt;</span> <span style="color: #d3869b;">T</span>)
  <span style="color: #d3869b;">Sleep</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Constant</span> (<span style="color: #d3869b;">E</span> <span style="color: #d3869b;">:-&gt;</span> <span style="color: #d3869b;">T</span>)
  <span style="color: #d3869b;">Teach</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Constant</span> (<span style="color: #d3869b;">E</span> <span style="color: #d3869b;">:-&gt;</span> (<span style="color: #d3869b;">E</span> <span style="color: #d3869b;">:-&gt;</span> <span style="color: #d3869b;">T</span>))
  <span style="color: #d3869b;">C</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Constant</span> <span style="color: #d3869b;">E</span>
  <span style="color: #d3869b;">J</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Constant</span> <span style="color: #d3869b;">E</span>
</pre>
</div>
<p>
We now also need an additional constructor in our encoding of the λ-calculus,
in order to inject constants into the data type.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">data</span> <span style="color: #d3869b;">Term</span> (&#947; <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Context</span>) (&#966; <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Type</span>) <span style="color: #fb4933;">where</span>
  <span style="color: #d3869b;">Var</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">In</span> &#966; &#947; <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Term</span> &#947; &#966;
  <span style="color: #d3869b;">Lam</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Term</span> (<span style="color: #d3869b;">Con</span> &#966; &#947;) &#968; <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Term</span> &#947; (&#966; <span style="color: #d3869b;">:-&gt;</span> &#968;)
  <span style="color: #d3869b;">App</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Term</span> &#947; (&#966; <span style="color: #d3869b;">:-&gt;</span> &#968;) <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Term</span> &#947; &#966; <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Term</span> &#947; &#968;
  <span style="color: #d3869b;">Con</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Constant</span> &#966; <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Term</span> &#947; &#966;
</pre>
</div>
<p>
Note that the contexts in which constants are well typed are arbitrary by
design. This property allows us to use them anywhere inside a λ-term.
</p>

<p>
We may now write a function <code>interpWord</code> to interpret words of English into the
λ-calculus, along with an associated function <code>interpExpr</code>, which extends the
interpretation of words to an interpretation of entire complex expressions.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">interpWord</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Word</span> c <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Term</span> <span style="color: #d3869b;">Empty</span> (<span style="color: #d3869b;">SemType</span> c)
<span style="color: #fabd2f;">interpWord</span> (<span style="color: #d3869b;">Word</span> <span style="color: #d3869b;">IsAnNP</span> <span style="color: #b8bb26;">"carina"</span>) <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Con</span> <span style="color: #d3869b;">C</span>                       <span style="color: #928374;">-- </span><span style="color: #928374;">&#10214;'carina'&#10215; = c</span>
<span style="color: #fabd2f;">interpWord</span> (<span style="color: #d3869b;">Word</span> <span style="color: #d3869b;">IsAnNP</span> <span style="color: #b8bb26;">"julian"</span>) <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Con</span> <span style="color: #d3869b;">J</span>                       <span style="color: #928374;">-- </span><span style="color: #928374;">&#10214;'julian'&#10215; = j</span>
<span style="color: #fabd2f;">interpWord</span> (<span style="color: #d3869b;">Word</span> <span style="color: #d3869b;">IsAnN</span> <span style="color: #b8bb26;">"dog"</span>) <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Lam</span> (<span style="color: #d3869b;">App</span> (<span style="color: #d3869b;">Con</span> <span style="color: #d3869b;">Dog</span>) (<span style="color: #d3869b;">Var</span> <span style="color: #d3869b;">First</span>)) <span style="color: #928374;">-- </span><span style="color: #928374;">&#10214;'dog'&#10215; = &#955;x.dog(x)</span>
<span style="color: #fabd2f;">interpWord</span> (<span style="color: #d3869b;">Word</span> <span style="color: #b8bb26;">"slept"</span> (<span style="color: #d3869b;">IsAnNP</span> <span style="color: #d3869b;">::\::</span> <span style="color: #d3869b;">IsAnS</span>)) <span style="color: #83a598;">=</span>                <span style="color: #928374;">-- </span><span style="color: #928374;">&#10214;'slept'&#10215; = &#955;x.sleep(x)</span>
  <span style="color: #d3869b;">Lam</span> (<span style="color: #d3869b;">App</span> (<span style="color: #d3869b;">Con</span> <span style="color: #d3869b;">Sleep</span>) (<span style="color: #d3869b;">Var</span> <span style="color: #d3869b;">First</span>))
<span style="color: #fabd2f;">interpWord</span> (<span style="color: #d3869b;">Word</span> <span style="color: #b8bb26;">"taught"</span> ((<span style="color: #d3869b;">IsAnNP</span> <span style="color: #d3869b;">::\::</span> <span style="color: #d3869b;">IsAnS</span>) <span style="color: #d3869b;">::/::</span> <span style="color: #d3869b;">IsAnNP</span>)) <span style="color: #83a598;">=</span> <span style="color: #928374;">-- </span><span style="color: #928374;">&#10214;'taught'&#10215; = &#955;x, y.teach(x)(y)</span>
  <span style="color: #d3869b;">Lam</span> (<span style="color: #d3869b;">Lam</span> (<span style="color: #d3869b;">App</span> (<span style="color: #d3869b;">App</span> (<span style="color: #d3869b;">Con</span> <span style="color: #d3869b;">Teach</span>) (<span style="color: #d3869b;">Var</span> (<span style="color: #d3869b;">Next</span> <span style="color: #d3869b;">First</span>))) (<span style="color: #d3869b;">Var</span> <span style="color: #d3869b;">First</span>)))


<span style="color: #fabd2f;">interpExpr</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Expr</span> c <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Term</span> <span style="color: #d3869b;">Empty</span> (<span style="color: #d3869b;">SempType</span> c)
<span style="color: #fabd2f;">interpExpr</span> (<span style="color: #d3869b;">Lex</span> w) <span style="color: #83a598;">=</span> interpWord w
<span style="color: #fabd2f;">interpExpr</span> (<span style="color: #d3869b;">AppL</span> e1 e2) <span style="color: #83a598;">=</span> <span style="color: #d3869b;">App</span> (interpExpr e2) (interpExpr e1)
<span style="color: #fabd2f;">interpExpr</span> (<span style="color: #d3869b;">AppR</span> e1 e2) <span style="color: #83a598;">=</span> <span style="color: #d3869b;">App</span> (interpExpr e1) (interpExpr e2)
</pre>
</div>
<p>
For example, you can interpret <i>julian taught carina</i> by doing
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #83a598;">&gt;&gt;&gt;</span> interpExpr (<span style="color: #d3869b;">AppL</span> (<span style="color: #d3869b;">Lex</span> (<span style="color: #d3869b;">Word</span> <span style="color: #b8bb26;">"julian"</span> <span style="color: #d3869b;">IsAnNP</span>)) (<span style="color: #d3869b;">AppR</span> (<span style="color: #d3869b;">Lex</span> (<span style="color: #d3869b;">Word</span> <span style="color: #b8bb26;">"taught"</span> ((<span style="color: #d3869b;">IsAnNP</span> <span style="color: #d3869b;">::\::</span> <span style="color: #d3869b;">IsAnS</span>) <span style="color: #d3869b;">::/::</span> <span style="color: #d3869b;">IsAnNP</span>))) (<span style="color: #d3869b;">Lex</span> (<span style="color: #d3869b;">Word</span> <span style="color: #b8bb26;">"carina"</span> <span style="color: #d3869b;">IsAnNP</span>))))
<span style="color: #d3869b;">App</span> (<span style="color: #d3869b;">App</span> (<span style="color: #d3869b;">Lam</span> (<span style="color: #d3869b;">Lam</span> (<span style="color: #d3869b;">App</span> (<span style="color: #d3869b;">App</span> (<span style="color: #d3869b;">Con</span> <span style="color: #d3869b;">Teach</span>) (<span style="color: #d3869b;">Var</span> (<span style="color: #d3869b;">Next</span> <span style="color: #d3869b;">First</span>))) (<span style="color: #d3869b;">Var</span> <span style="color: #d3869b;">First</span>)))) (<span style="color: #d3869b;">Con</span> <span style="color: #d3869b;">C</span>)) (<span style="color: #d3869b;">Con</span> <span style="color: #d3869b;">J</span>) <span style="color: #928374;">-- </span><span style="color: #928374;">(&#955;x, y.teach(x)(y)) c j</span>
</pre>
</div>
<p>
Compare to what you get if you also apply <code>normalForm</code> at the top:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #83a598;">&gt;&gt;&gt;</span> normalForm (interpExpr (<span style="color: #d3869b;">AppL</span> (<span style="color: #d3869b;">Lex</span> (<span style="color: #d3869b;">Word</span> <span style="color: #b8bb26;">"julian"</span> <span style="color: #d3869b;">IsAnNP</span>)) (<span style="color: #d3869b;">AppR</span> (<span style="color: #d3869b;">Lex</span> (<span style="color: #d3869b;">Word</span> <span style="color: #b8bb26;">"taught"</span> ((<span style="color: #d3869b;">IsAnNP</span> <span style="color: #d3869b;">::\::</span> <span style="color: #d3869b;">IsAnS</span>) <span style="color: #d3869b;">::/::</span> <span style="color: #d3869b;">IsAnNP</span>))) (<span style="color: #d3869b;">Lex</span> (<span style="color: #d3869b;">Word</span> <span style="color: #b8bb26;">"carina"</span> <span style="color: #d3869b;">IsAnNP</span>)))))
<span style="color: #d3869b;">App</span> (<span style="color: #d3869b;">App</span> (<span style="color: #d3869b;">Con</span> <span style="color: #d3869b;">Teach</span>) (<span style="color: #d3869b;">Con</span> <span style="color: #d3869b;">C</span>)) (<span style="color: #d3869b;">Con</span> <span style="color: #d3869b;">J</span>) <span style="color: #928374;">-- </span><span style="color: #928374;">teach(c)(j)</span>
</pre>
</div>
<p>
Neat.
</p>
</div>
</div>
